package Ch02;

public class C02음수 {

//	컴퓨터(CPU)는 구조상 덧셈연산를 할 수 있다(o)
//	컴퓨터(CPU)는 구조상 뺄셈연산를 할 수 있다(x)
//	컴퓨터(CPU)에서 뺄셈요청시 뺄셈처리는 할 수 있다(o)
//	보수개념을 도입해서 뺄셈처리를 수행하기 때문에 가능
//	
//	7 - 4 = 3
//	
//	7 + 6 = 3
//	
//	77 - 32 = 45
//	77 + 68 = 45
//	
//	5 - 5 = 0
//	
//	    00000101 = 5
//      11111010 = -6(1의 보수)
//  +   00000001 = 
//  +	11111011 = -5(2의 보수)
//  ---------------
//    00000000 = 0
    
	
    
    	//문제
		//음수값임을 고려하여 풉니다
		//10 진수 	-> 2진수
		//111 		-> 
		//-111 		->  
		//96		->  
		//-96		->  
		//31 		->  
		//-31		->  
		
		//2진수		-> 10진수
		//10101111 	->  
		//00110101	->  
		//11001100	->  
		//10101010	->  


}
